/*
Navicat MySQL Data Transfer

Source Server         : local_db
Source Server Version : 50616
Source Host           : localhost:3306
Source Database       : newsone

Target Server Type    : MYSQL
Target Server Version : 50616
File Encoding         : 65001

Date: 2018-03-16 17:24:12
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `tbl_news`
-- ----------------------------
DROP TABLE IF EXISTS `tbl_news`;
CREATE TABLE `tbl_news` (
  `news_id` int(10) NOT NULL AUTO_INCREMENT,
  `news_catgory` int(3) DEFAULT NULL,
  `news_title` varchar(150) CHARACTER SET utf8 DEFAULT NULL,
  `news_contation1` text CHARACTER SET utf8,
  `news_contation2` text CHARACTER SET utf8,
  `news_cover_img` varchar(100) DEFAULT NULL,
  `news_hover_img` varchar(100) DEFAULT NULL,
  `news_title_img` varchar(100) DEFAULT NULL,
  `news_date` date DEFAULT NULL,
  `news_time` time DEFAULT NULL,
  `news_active` tinyint(1) DEFAULT '1',
  `added_by` int(10) DEFAULT NULL,
  `added_at` datetime DEFAULT NULL,
  `edit_by` int(10) DEFAULT NULL,
  `edit_at` datetime DEFAULT NULL,
  PRIMARY KEY (`news_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of tbl_news
-- ----------------------------
INSERT INTO `tbl_news` VALUES ('1', '1', 'u;ska .u mqojd .ekSu wrUd wjika', 'සාමකාමී ශ්‍රී ලාංකීය සමාජයක් ස්ථාපිත කිරීම උදෙසා ග්‍රාමීය ප්‍රජාවගේ දායකත්වය ලබා ගැනීමේ අරමුණින් \'මතින් නිදහස් රටක්\' ජාතික වැඩපිළිවෙළ යටතේ ක්‍රියාත්මක \'ගම හදා ගමු\' ග්‍රාමීය මත්ද්‍රව්‍ය නිවාරණ වැඩසටහන යටතේ ලංකාවේ සියලූම ගම්මානවල ප්‍රජා පොලිස් කමිටු මූලික කර ගෙන මත්ද්‍රව්‍ය වැටලීම් පුනරුත්ථාපන හා නිවාරණ කටයුතු මේ වන විටත් ආරම්භ කොට ඇති බව ජනාධිපති මෛත්‍රීපාල සිරිසේන මහතා අවධාරණය කරයි.\r\n\r\nජනාධිපතිවරයා මේ බව පැවසූවේ ඇඹිලිපිටිය මහවැලි ක්‍රීඩාංගණයේ දී ජනාධිපති මෛත්‍රීපාල සිරිසේන මහතාගේ ප්‍රධානත්වයෙන් ඊයේ (23) පැවැත් වුණ \'ගම හදා ගමු\' ග්‍රාමීය මත්ද්‍රව්‍ය නිවාරණ වැඩසටහනේ සමාරම්භක අවස්ථාවට එක්වෙමිනි.\r\n\r\nඉදිරියට ද මෙම වැඩසටහන සාර්ථක කැර ගැනීමට රටට ආදරය කරන සියලූ ජනතාව එකාවන්ව පෙළගැසෙනු ඇති බවට ද ජනාධිපතිතුමා විශ්වාසය පළ කෙළේය.\r\n\r\nපසුගිය වසර දහයකට ආසන්න කාලයක් මත්ද්‍රව්‍ය පාලනය, මර්දනය,නිවාරණය සම්බන්ධයෙන් ගෙන ගිය මෙවැනි වැඩසටහන් තුළින් මේ වන විට ජයග්‍රහණ රාශියක් අත්කර ගෙන ඇති අතර පසුගිය අවුරුදු කිහිපය තුළ දුම්පානය අඩුවීම පැහැදිලිව පෙන්වන සාක්කියක් බවත් සෞඛ්‍ය ක්ෂේත්‍රයේ වගේම එය මේ රටේ ජනතාව ලැබු විශිෂ්ඨ ජයග්‍රහණයක් බවද ජනාධිපතිවරයා කියා සිටියේය.\r\n\r\nඅැමැතිවරුන් වන රාජිත සේනාරත්න, ජෝන් සෙනෙවිරත්න, තලතා අතුකෝරළ, මහින්ද අමරවීර, නියෝජ්‍ය අැමැති කරුණාරත්න පරණවිතාන යන මහත්වරුන් ඇතුළු මැතිඇමතිවරු පිරිසක් ද, රත්නපුර දිස්ත්‍රික් ලේකම්, ප්‍රාදේශීය ලේකම්වරු, අධ්‍යාපන අධ්‍යක්ෂවරු ඇතුළු රාජ්‍ය නිලධාරින් සහ ආරක්ෂක අංශ ප්‍රධානීන් ඇතුළු පිරිසක් මෙම අවස්ථාවට එක්ව සිටියහ.', null, 'blog-sslider.jpg', 'blt-banner1-Recovered.jpg', 'blog-sslider.jpg', '2018-02-26', '19:14:45', '1', '1', '2018-02-27 11:14:29', null, null);
INSERT INTO `tbl_news` VALUES ('2', '1', 'පුංචි ආණ්ඩු මාර්තු 06 සිට වැඩ.', 'පළාත්පාලන ආයතන ධුර කාලය ලබන මස 6 වැනිදා ආරම්භ විය යුතු බව පළාත් සභා හා පළාත් පාලන අමාත්‍යාංශයේ ලේකම් එච්. ටී. කමල් පත්මසිරි මහතා පවසයි.\r\n\r\nපළාත් සභා සහ පළාත් පාලන අමාත්‍ය ෆයිසර් මුස්තාෆා මහතා අදාළ ගැසට් නිවේදනය පළ කිරීමෙන් පසුව මෙය ක්‍රියාත්මක වේ.\r\n\r\nකාන්තා නියෝජනයේ ඇති ගැටලු මේ සභාවන් ආරම්භ කිරීමට කිසිදු බාධාවක් නොවන බවද ලේකම්වරයා පවසා සිටී.', null, '1-1.jpg', '1-2.jpg', '1-1.jpg', '2018-02-26', '11:14:45', '1', '1', '2018-02-27 11:14:29', null, '0000-00-00 00:00:00');
INSERT INTO `tbl_news` VALUES ('3', '1', 'ජනතාවගේ ඇගට පතට බඩට කටට හදවතට දැනෙන වැඩ පිළිවෙලක්', '\r\nදින තුනක් ඇතුලත ජනතාවගේ ඇගට පතට බඩට කටට හදවතට දැනෙන, ඇස් දෙකට පෙනෙන කන්වලට මිහිරි ජනතා සුබ සාධන සැලැස්මක් රට පුරාම දියක් කිරීමට එක්සත් ජාතික පක්‍ෂය සූදානම් වන බව ඇමති සජිත් පේ‍්‍රමදාස මහතා පවසයි.\r\n\r\n\r\nඔහු මේ බව කියා සිටියේ සිරිකොත එජාප මූලස්ථානයේදී අගමැති රනිල් වික‍්‍රමසිංහ මහතා ඇතුළු මැති ඇමති පිරිසක් සමග පැවැති සාකච්චාවකදී මාධ්‍ය වෙත අදහස් පල කරමිනි.', null, '2-1.jpg', '2-2.jpg', '2-1.jpg', '2018-02-27', '11:14:45', '1', '1', '2018-02-27 11:14:29', null, '0000-00-00 00:00:00');
INSERT INTO `tbl_news` VALUES ('4', '1', '\'බ්‍රිගේඩියර් ප්‍රියංක ලංකාවට ගෙන්නුවේ ඔහුගේ ආරක්ෂාවට\' - යුදහමුදාපති ', 'බ්‍රිතාන්‍ය මහකොමසාරිස් කාර්යාලයේ ආරක්ෂක කටයුතු පිළිබඳ උපදේශක බ්‍රිගේඩියර් ප්‍රියංක ප්‍රනාන්දුගේ මහතා ශ්‍රීලංකාවට ගෙන්වූවේ එතුමන්ගේ ආරක්ෂාව වෙනුවෙන් බවට යුධ හමුදාපති මහේෂ් සේනානායක මහතා අද(24) වවුනියාවේදී පැවසුවේය.\r\n\r\nවන්නි ආරක්ෂක සේනා 56 සේනාංකයේ නව කාර්යාල සංකීර්ණය විවෘත කිරීමේ අවස්ථාවට එක්වෙමින් යුධ හමුදාපතිවරයා එලෙස පැවසුවේය.\r\n\r\nරුපියල් මිලියන 24 ක වියදමින් ඉදිකළ 56 සේනාංකයේ නව කාර්යාල සංකීර්ණය ඉදිකොට තිබිණ.\r\n\r\nනවා කාර්යාල ගොඩනැගිල්ල විවෘත්ත කිරීමෙන් පසුව මාධ්‍යට අදහස් දක්වමින් යුදහමුදාපති වරයා කියා සිටියේ,\r\n\r\n‘රටේ යුද හමුදාපති හැටියට ඒ නිලධාරියාගේ ආරක්ෂාවට මම වගකියන්න ඕන මේ නිලධාරියා වෙනත් රටක ඒ රටේ නීති පද්දතියට යටත්ව රාජකාරි කරන අතරේදී යුදහමුදාපති හැටියට හෝ වෙනත් අධිකරණ විශ්වාශවන්තව දැනුවත් කරන්න බැහැ ඔහුගේ ආරක්ෂාව තහවුරු වෙයි කියලා ඒ ගැන සාකච්ඡා කරන්න මම ඔහුට එන්න කිව්වා ඔහු දැන් ඇවිල්ල ඉන්නවා දැන් මම ඉන්නේ කොළඹින් පිට නමුත් මම ඉදිරියේදී ඔහුත් සමග සාකච්ඡා කරනවා.\r\n\r\nඔහු කරපු දේ හරිද වැරිද කියල තීරණය කළ යුතුව ඇත්තේ වෙනම කෙනෙක් නමුත් ඒ නිලධාරියා මෙහෙ ඇවිත් ඉන්නේ ඔහුගේ කාලය ඉවර වෙලා නෙමෙයි අපි සාකච්ඡා කරන්නේ ඔහුගේ ආරක්ෂාව කොහොමද අපි සපයන්නේ කියලා ඒ වගේම මේ අවස්ථාවේධී ඒ සිද්දියෙන් අයින්වෙලා ඉන්න එක මම හිතනවා සුදුසු නුවනක් කියලා ඒ වගේම කනගාටු වෙනවා මේ රටේ ජනතාව අනවශ්‍ය බියකට මේක සිද්ධියක් කරගෙන තියන එක ගැන මේ වගේ සිද්ධි ඕන තරම් වෙලා තියනවා නමුත් රණවිරුවන් දඩමීමා කරගත නොගත යුතුයි මේ රටේ පාලනය නෙමෙයි මේක කරන්නේ මේක එක්තරා සිදුවීමක්.යනුවෙනි.\r\n\r\nයුධ හමුදාපතිවරයා පැවසූවේ දියතලාව බස් බෝම්බය සජීවි අත් බෝම්බයක් පිපිරීමක් වන බව පැහැදිලිවල අතර,අදාළ සිදුවීම සම්බන්ධයෙන් මේ වන විට මේජරජෙනරාල් වරයෙකුගේ නායකත්වයෙන් යුත් 6 දෙනෙකුගෙන් යුතු කණ්ඩායමක් විසින් පරීක්ෂණ කටයුතු සිදු කරන බවටත්.\r\n\r\nබස් රථයේ බෝම්බ පිපිරීම සම්බන්ධයෙන් රටේ ජනතාවට කලබල විය යුතු නොවන අතර, එයින් ජාතික ආරක්ෂාවට තර්ජනයක් නොවන බවද යුධ හමුදාපතිවරයා පැවසුවේය.\r\n\r\nවැඩසටහනට වන්නි ආරක්ෂක සේනා ආඥාපති මේජර් ජෙනරල් කුමුදු පෙරේරා මහතා ඇතුළු යුධ හමුදා උසස් නිළධාරීන් විශාල පිරිසක් සහභාගි වී සිටියහ.', null, '3-1.jpg', '3-2.jpg', '3-1.jpg', '2018-02-27', '11:14:45', '1', '1', '2018-02-27 11:14:29', null, '0000-00-00 00:00:00');
INSERT INTO `tbl_news` VALUES ('5', '1', 'රවීට ඇමතිකම් නෑ : එජාප පසුපෙලේ විරෝධය.', 'හිටපු මුදල් අමාත්‍ය රවී කරුණානායක මහතාට අමාත්‍යධූරයක් ලැබෙන බවට පුවත් පලවී තිබුණද ඔහුට අමාත්‍යධූරයක් හිමි නොවන බව ජනාධිපති කාර්යාල ආරංචි මාර්ගවලින් වාර්තා වේ.\r\n\r\nරවීට අමාත්‍යධූරයක් ලබාදීමට සුදුසු බව එජාප ප්‍රබලයින් ඇතුළු එජාප පසු පෙළ මන්ත්‍රීවරුද යෝජනා කර තිබුණද අගමැති රනිල් වික්‍රමසිංහ මහතා විසින් ජනාධිපතිවරයා වෙත යැවූ අමාත්‍යධූර ලබාදිය යුතු ලයිස්තුවේ කරුණානායක මහතාගේ නම ඇතුළත්ව තිබී නොමැත.\r\n\r\nබැඳුම්කර සිද්ධිය සම්බන්ධයෙන් කරුණානායක මහතාගේද නම ඈදීම හේතුවෙන් ඔහු මුදල් අමාත්‍ය ධූරයෙන් ඉවත් කළ අතර, පසුව මහ බැංකු බැඳුම්කර වංචාව සම්බන්ධයෙන් පත් කරන ලද ජානාධිපති කොමිසමේ වාර්තාවෙන් ඔහුට සෘජු චෝදනා එල්ලවී නොතිබිණි.\r\n\r\nඑසේම, ඒ මහතා පාර්ලිමේන්තුවට ප්‍රකාශයක් කිරීමට උත්සාහ කළ ද ඊට අවස්ථාව නොලැබුණු අතර, පසුව අදාළ ප්‍රකාශය ඔහු මාධ්‍යට මුදාහැර තිබිණි.\r\n\r\nඑම වාර්තාව මගින් මහ බැංකුව සහ බැඳුම්කර ගනුදෙනුව කරුණානායක මහතා යටතේ ක්‍රියාත්මක වන හෝ ඔහුගේ බලපෑම යටතේ ඇති ආයතනයක් නොවන බවද පිළිගෙන ඇති බව කරුණානායක මහතා හෙළික කළේය.\r\n\r\nකෙසේවුවද, එයට ඉන් පසුව විරෝධත්වයක්ද මතු නොවුණි.\r\n\r\nමේවන විට කරුණානායක මහතාට චෝදනා එල්ලවී හෝ වරදකරුවකු නොවන බැවින් ඔහුට අමාත්‍ය ධූරයක් ලබා නොදීම අසාධාරණ බව එජාප පසු පෙළ පාර්ලිමේන්තු මන්ත්‍රීවරු අගමැතිවරයාට පවසා තිබේ.', null, '4-1.jpg', '4-2.jpg', '4-1.jpg', '2018-02-27', '13:01:33', '1', '1', '2018-02-27 13:01:41', null, null);
INSERT INTO `tbl_news` VALUES ('6', '1', 'බැසිල්ගෙන් උදයට කැපිල්ලක්', 'දේශපාලනයේ අලුයට ගිනි නැංවෙමින් ඇත. පලාත් පාලන මැතිවරණ ජයග්‍රහණයෙන් පසු හිස උදුම්මාගත් බැසිල් රාජපක්ෂ ප්‍රමුඛ බැසිල්ගේ වන්දිභට්ඨයින් විසින් ඒකාබද්ධ ජනරැල්ලට උරදුන් පක්ෂ නායකයින් හට කැපිල්ලක් ක්‍රියාත්මක කර ඇති බව විශ්වාස කටයුතු ආරංචි මාර්ග වලින් දැනගන්නට ඇත. එහි පළමු ප්‍රහාරය එල්ල වූයේ පිවිතුරු හෙල උරුමයේ නායක උදය ගම්මන්පිලටයි. ඊයේ (23) දින පැවති ඒකාබද්ධ පොදුජන පෙරමුණේ පක්ෂ නායක හමුව සඳහා පිවිතුරු හෙළ උරුමයේ නායක උදය ගම්මන්පිලට ආරාධනා කර නොමැති බව වාර්තා වේ. ඒ අනුව ගම්මන්පිල විසින් බැසිල් රාජපක්ෂ හට දුරකථනයෙන් අමතා සිය පක්ෂයට ආරාධනා නොකලේ ඇයි දැයි විමසා ඇත. එයින් උරණ වූ බැසිල් මෙසේ පවසා ඇත. ” මේකට ආරාධනා කලේ නැහැ කාටවත්, ඉල්ලීම් කරපු අයට විතරක් අවස්ථාව දුන්නා. අනික ආරාධනා කරන්න ඔයා කවුද ? ” යනුවෙන් විමසා ඇත. එවිට ගම්මන්පිල විසින් පෙන්වා දී ඇත්තේ තමන් එම කමිටුවේ සභිකයෙකු බවත් ඒ නිසා ආරාධනා කල යුතු නමුත් අවම වශයෙන් දැනුම් දීමට හෝ තිබුනු බවයි. එවිට බැසිල් විසින් උස් හඬින් පවසා ඇත්තේ .. ” ඔයා මම කවුරු කියලද හිතාගෙන ඉන්නෙ. මම එක එකාට දෙකට නැවෙන්න යන්නෙ නැහැ. ඒ මගේ හැටි. වැඩක් බලාගෙන ඉන්න, බැරිනම් යන්න. ” යනුවෙනි. එවිට උදය පවසා ඇත්තේ ” ඇයි ඔයා ඔච්චර සද්දෙන් කතා කරන්නෙ. අපි මොකක්ද කරපු වරද ” යනුවෙනි. එවිට නැවතත් බැසිල් පවසා ඇත්තේ ” ඔය සුලු පක්ෂවල අය මොනවද කලේ. මේක පොදුජන පෙරමුණේ ජන රැල්ල. අන්න ඒක තේරුම් අරගෙන වැඩ කරගෙන ඉන්නවා. ඔයාගේ නායකයටත් ඕක කියනවා ” යනුවෙනි එවිට නැවතත් ගම්මන්පිල පවසා ඇත්තේ ” කවුද මගේ නායකයා. මම පිවිතුරු හෙළ උරුමයේ නායකයා ” එවිට උරණ වූ බැසිල් ” විමල් වීරවංශ ” යනුවෙන් පවසා දුරකථනය විසන්ධි කොට ඇත. මේ සිද්ධිය පිළිබඳව ගම්මන්පිල විසින් දැඩි කලකිරීමට පත්ව ඇති බව වාර්තා වේ. මේ සිද්ධිය හිටපු ජනපතිවරයා දැනුවත් කිරීමට ඔහු උත්සාහ කලද, එයද ව්‍යර්ථ වූ බව තතු දත් ආරංචි මාර්ග සඳහන් කරයි. මහින්ද රාජපක්ෂ මහතා ජනපතිවරණයෙන් පරාජය වූ මොහොතේ බැසිල් සිය බිරිඳද කැටුව මෙරටින් පලා ගිය අතර, මහින්ද රාජපක්ෂ මහතා වෙනුවෙන් නැවතත් ජනරැල්ලක් ගොඩනගා ජයග්‍රාහී මාවත දක්වා ගෙන ආවේ විමල්, දිනේෂ්, වාසු, උදය වැනි සෙසු පක්ෂ නායකින්ය. මේ ආකාරයට බැසිල්ගේ ඒකාධිපති ස්වරූපය හරහා බැසිල් ගමන් කරන්නේ කොතනටද යන්න නැවතත් විමසා බැලිය යුතුය', null, null, '5-2.jpg', null, '2018-02-25', '16:05:23', '1', null, null, null, null);

-- ----------------------------
-- Table structure for `tbl_news_category`
-- ----------------------------
DROP TABLE IF EXISTS `tbl_news_category`;
CREATE TABLE `tbl_news_category` (
  `news_cat_id` int(3) NOT NULL,
  `news_cat_title` varchar(150) DEFAULT NULL,
  PRIMARY KEY (`news_cat_id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of tbl_news_category
-- ----------------------------
INSERT INTO `tbl_news_category` VALUES ('1', 'Local news');
INSERT INTO `tbl_news_category` VALUES ('2', 'Foreign news');
INSERT INTO `tbl_news_category` VALUES ('3', 'Sport news');
INSERT INTO `tbl_news_category` VALUES ('4', 'Gossip');
INSERT INTO `tbl_news_category` VALUES ('5', 'Entertaintments');

-- ----------------------------
-- Table structure for `tbl_user`
-- ----------------------------
DROP TABLE IF EXISTS `tbl_user`;
CREATE TABLE `tbl_user` (
  `user_id` int(5) NOT NULL AUTO_INCREMENT,
  `user_name` varchar(60) DEFAULT NULL,
  `user_pw` varchar(250) DEFAULT NULL,
  `user_mail` varchar(120) DEFAULT NULL,
  `user_active` tinyint(1) DEFAULT '1',
  `user_level` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tbl_user
-- ----------------------------
INSERT INTO `tbl_user` VALUES ('1', 'admin', '700c8b805a3e2a265b01c77614cd8b21', '.', '1', '1');

-- ----------------------------
-- Table structure for `tbl_vedio`
-- ----------------------------
DROP TABLE IF EXISTS `tbl_vedio`;
CREATE TABLE `tbl_vedio` (
  `vedio_id` int(5) NOT NULL AUTO_INCREMENT,
  `vedio_title` varchar(150) DEFAULT NULL,
  `vedio_link` varchar(250) DEFAULT NULL,
  `vedio_active` tinyint(1) DEFAULT '0',
  `video_add_date` date DEFAULT NULL,
  PRIMARY KEY (`vedio_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tbl_vedio
-- ----------------------------
INSERT INTO `tbl_vedio` VALUES ('1', '1', 'https://www.youtube.com/embed/dUuXaxJLMYA', '1', '2018-03-16');
INSERT INTO `tbl_vedio` VALUES ('2', '2', 'https://www.youtube.com/embed/M7fbirgzL3Q', '1', '2018-03-16');
